Revit 2027 API
ExclusionFilter.GetIdsToExclude Method
 Returns the ids to be excluded by this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetIdsToExclude()
Public Function GetIdsToExclude As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetIdsToExclude()
member GetIdsToExclude : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The collection of ids to exclude.
See Also
Reference
ExclusionFilter Class
Autodesk.Revit.DB Namespace